In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('../input'):
    for filename in filenames:
        file_  = os.path.join(dirname, filename)

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

In [2]:
df = pd.read_csv(file_)

df.head(5)

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
0,Afghanistan,Asia,Monthly,853.74,1001.15,252.53,4460.97
1,Aland Islands,Europe,Monthly,3319.24,3858.35,972.52,17124.74
2,Albania,Europe,Monthly,832.84,956.92,241.22,4258.49
3,Algeria,Africa,Monthly,1148.84,1308.81,330.11,5824.18
4,American Samoa,Oceania,Monthly,1390.00,1570.00,400.00,6980.00

In [3]:
df.duplicated().sum()

0

In [4]:
df.isnull().sum()

country_name      0
continent_name    0
wage_span         0
median_salary     0
average_salary    0
lowest_salary     0
highest_salary    0
dtype: int64

In [5]:
df.describe(include = 'all')

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
count,221,221,221,221.000000,221.000000,221.000000,221.000000
unique,221,9,1,NaN,NaN,NaN,NaN
top,Afghanistan,Africa,Monthly,NaN,NaN,NaN,NaN
freq,1,57,221,NaN,NaN,NaN,NaN
mean,NaN,NaN,NaN,1762.631906,1982.339812,502.783204,8802.165619
std,NaN,NaN,NaN,1634.708716,1835.429193,470.073328,8140.210641
min,NaN,NaN,NaN,0.261335,0.285524,0.072092,1.271103
25%,NaN,NaN,NaN,567.210000,651.000000,163.930000,2900.480000
50%,NaN,NaN,NaN,1227.460000,1344.230000,339.450000,5974.360000
75%,NaN,NaN,NaN,2389.010000,2740.000000,690.000000,12050.740000
max,NaN,NaN,NaN,9836.070000,11292.900000,2850.270000,50363.930000

In [6]:
df = df.drop(['wage_span'] , axis = 1)

In [7]:
df.sort_values('continent_name')

,country_name,continent_name,median_salary,average_salary,lowest_salary,highest_salary
220,Zimbabwe,Africa,555.40204,602.37635,151.42305,2674.772
59,Egypt,Africa,254.53000,298.51000,75.36000,1329.240
129,Mayotte,Africa,2389.01000,2748.41000,697.67000,12262.160
137,Morocco,Africa,1634.24000,1896.89000,477.63000,8433.850
138,Mozambique,Africa,549.81000,631.27000,159.77000,2803.880
...,...,...,...,...,...,...
27,Brazil,South America,1490.04000,1711.16000,432.27000,7609.560
24,Bolivia,South America,1131.50000,1236.99000,312.14000,5505.780
69,French Guiana,South America,2896.41000,3319.24000,835.10000,14799.150
40,Chile,South America,1890.40000,2090.56000,525.98000,9274.090
42,Colombia,South America,995.60000,1157.85000,292.53000,5137.790

In [8]:
sorted_order = (
    df.groupby('continent_name' , as_index = False)
    .agg({'median_salary':'mean'})
    .sort_values('median_salary' , ascending = True)
)['continent_name'].values

In [9]:
tp5_highestslry_contry_conti = (
    df.sort_values('highest_salary' , ascending = False).groupby('continent_name')
    .head(5)
    .sort_values(['continent_name','highest_salary'] , ascending = [True, False])
)

cont_order = (
    df.groupby('continent_name')
    .agg({'highest_salary':"max"})
    .sort_values('highest_salary' , ascending = False)
    .index
).tolist()

In [10]:
cont_order = (
    df.groupby('continent_name')
    .agg({'lowest_salary':"min"})
    .sort_values('lowest_salary' , ascending = False)
    .index
).tolist()

tp5_lwstslry_contry_conti = (
    df.sort_values('lowest_salary' , ascending = True).groupby('continent_name')
    .head(5)
    .sort_values(['continent_name','lowest_salary'] , ascending = [True, True])
)